app/controllers/topics_controller.rb

  def create
    @topic = Topic.create!(params[:topic])
---
INSERT INTO "topics" ("created_at", "title", "updated_at", "description") VALUES('2009-06-13 20:53:33', 'Watermelon Eating', '2009-06-13 20:53:33', 'We will eat yummy watermelons.')