app/controllers/votes_controller.rb

SELECT * FROM "topics" WHERE ("topics"."id" = 1)
INSERT INTO "votes" ("created_at", "updated_at", "topic_id") VALUES('2009-06-13 22:56:53', '2009-06-13 22:56:53', 1)
---
  def create
    @topic = Topic.find(params[:topic_id])
    @vote = @topic.votes.create!